In [68]:
# libraries

import pandas as pd

### Loading dataset provided by the Hufflepuff team
The data is on restaurant recommendations on TripAdvisor

In [69]:
df = pd.read_csv('TripAdvisor.csv', delimiter=';')
savedf = df.copy()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3062 entries, 0 to 3061
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Name              3062 non-null   object
 1   Street Address    3061 non-null   object
 2   Location          3061 non-null   object
 3   Type              3033 non-null   object
 4   Reviews           2994 non-null   object
 5   No of Reviews     3036 non-null   object
 6   Comments          2430 non-null   object
 7   Contact Number    3061 non-null   object
 8   Trip_advisor Url  3049 non-null   object
 9   Menu              3061 non-null   object
 10  Price_Range       3061 non-null   object
dtypes: object(11)
memory usage: 263.3+ KB

In [70]:
df.describe()

,Name,Street Address,Location,Type,Reviews,No of Reviews,Comments,Contact Number,Trip_advisor Url,Menu,Price_Range
count,3062,3061,3061,3033,2994,3036,2430,3061,3049,3061,3061
unique,2643,2813,2652,681,11,818,2274,2849,2873,705,7
top,Texas Roadhouse,3333 Bristol St,"Costa Mesa, CA 92626-1873","Italian, Vegetarian Friendly, Vegan Options",4.5 of 5 bubbles,58 reviews,A very little restaurant but they provide amaz...,Not Available,https://www.tripadvisor.com//Restaurant_Review...,Check The Website for a Menu,$$ - $$$
freq,13,8,8,137,1914,18,4,19,4,2252,2383

In [71]:
df.head()

,Name,Street Address,Location,Type,Reviews,No of Reviews,Comments,Contact Number,Trip_advisor Url,Menu,Price_Range
0,Betty Lou's Seafood and Grill,318 Columbus Ave,"San Francisco, CA 94133-3908","Seafood, Vegetarian Friendly, Vegan Options",4.5 of 5 bubbles,243 reviews,NaN,+1 415-757-0569,https://www.tripadvisor.com//Restaurant_Review...,Check The Website for a Menu,$$ - $$$
1,Coach House Diner,55 State Rt 4,"Hackensack, NJ 07601-6337","Diner, American, Vegetarian Friendly",4 of 5 bubbles,84 reviews,"Both times we were there very late, after 11 P...",+1 201-488-4999,https://www.tripadvisor.com//Restaurant_Review...,Check The Website for a Menu,$$ - $$$
2,Table Talk Diner,2521 South Rd Ste C,"Poughkeepsie, NY 12601-5476","American, Diner, Vegetarian Friendly",4 of 5 bubbles,256 reviews,Waitress was very friendly but a little pricey...,+1 845-849-2839,https://www.tripadvisor.com//Restaurant_Review...,http://tabletalkdiner.com/menu/breakfast/,$$ - $$$
3,Sixty Vines,3701 Dallas Pkwy,"Plano, TX 75093-7777","American, Wine Bar, Vegetarian Friendly",4.5 of 5 bubbles,235 reviews,Not sure why I went there for the second time....,+1 469-620-8463,https://www.tripadvisor.com//Restaurant_Review...,https://sixtyvines.com/menu/plano-tx/,$$ - $$$
4,The Clam Bar,3914 Brewerton Rd,"Syracuse, NY 13212","American, Bar, Seafood",4 of 5 bubbles,285 reviews,Doesn't look like much from the outside but wa...,+1 315-458-1662,https://www.tripadvisor.com//Restaurant_Review...,Check The Website for a Menu,$$ - $$$

In [72]:
df.isnull().sum()

Name                  0
Street Address        1
Location              1
Type                 29
Reviews              68
No of Reviews        26
Comments            632
Contact Number        1
Trip_advisor Url     13
Menu                  1
Price_Range           1
dtype: int64

Drop columns that do not provide any information and rename columns to remove spaces

In [73]:
print(df.columns)
df = df.drop(['Street Address', 'Trip_advisor Url', 'Contact Number', 'Location', 'Comments'], axis=1)
df = df.rename(mapper={"No of Reviews": "No_of_Reviews"}, axis='columns')
df.columns

Index(['Name', 'Street Address', 'Location', 'Type', 'Reviews',
       'No of Reviews', 'Comments', 'Contact Number', 'Trip_advisor Url',
       'Menu', 'Price_Range'],
      dtype='object')

Index(['Name', 'Type', 'Reviews', 'No_of_Reviews', 'Menu', 'Price_Range'], dtype='object')

The 'Reviews' & 'No of reviews' columns can give us more information in numeric form.

In [74]:
def extract_rev(rev):
  rev = str(rev)
  rev_txt = rev.split()[0].replace(',', '.')
  try:
    return float(rev_txt)
  except:
    return -1

print(df.Reviews.unique())
df['Reviews'] = df['Reviews'].apply(extract_rev)
print(df.Reviews.unique())
df = df[(df['Reviews'] > 0) & (df['Reviews'] <= 5)]
df.Reviews.unique()

['4.5 of 5 bubbles' '4 of 5 bubbles' '5 of 5 bubbles' '3.5 of 5 bubbles'
 '4,5 of 5 bubbles' '6 of 5 bubbles' '100 of 5 bubbles' '3 of 5 bubbles'
 nan 'No review' '0 of 5 bubbles' '-5 of 5 bubbles']
[  4.5   4.    5.    3.5   6.  100.    3.    nan  -1.    0.   -5. ]

array([4.5, 4. , 5. , 3.5, 3. ])

In [75]:
def extract_rev_num(rev):
  rev = str(rev).split()[0]
  try:
    return int(rev)
  except:
    return -999

# print(df['No_of_Reviews'].unique())
df['No_of_Reviews'] = df['No_of_Reviews'].replace('([,.]+)', '', regex=True)
df['No_of_Reviews'] = df['No_of_Reviews'].replace('[oO]', '0', regex=True)
df['No_of_Reviews'] = df['No_of_Reviews'].apply(extract_rev_num)
df = df[(df['No_of_Reviews'] >= 0) & (df['No_of_Reviews'] < 100000)]

df['No_of_Reviews'].unique()
# df['No_of_Reviews'].sort_values()[:10]

array([ 243,   84,  256,  235,  285, 1406,  220,   89,   90,  258,  271,
         87,  118,  706,  104,  314,  193, 1198,  280, 1807,  642,  928,
         30,  179,  746,  119,  829,  515,  123,  189,   39,  742,  264,
        399,  111,   24,  187, 1653,  223,  153,  240,  364,  191,  775,
        124,  198,  292,   29,  683,   27,  214,  513,   44,   28,  611,
        307,  440,  660,  413,  135,   74,  160,  273,   86,  932,  378,
        217,  437,  138,   51,  250,  219,  184,  174,   11,   58,   12,
       1490,  162,  401,  301,  493,  100,   54,   25,  516,  282,  202,
       1492,  114,  108,   47,   77,  166,  161,  182,  315,  165,  412,
        373,  116,  210,   67,  132,  404,   46,  393,  545,  488,   95,
        379, 1788, 1371,  171,  203,   65,  269,  181,  368,  783,  276,
        262,  103,  322,  441,   64,  236,  350,  201,  310,  332,  805,
        238,   23, 3274,  130,  563,  532,  253,  128,  144,  141,  185,
        150,  122,  241,  209,   80,  206,  137,  428,   82,  311,  224,
         43,   40,  820,  395,  593,  151,  146,  317,  216,  218,  239,
        362, 1123,   85,   21,  443,  354,   55,  821,  164,  211,  564,
        244,   56,  270,   71,  670, 1633,  290, 1256,  346,   13, 1544,
        205,  204,  319,   42, 1045,  267,  170,   78,  455,  147,  351,
       2518, 1076,  245,  261,  369,  540,  148,  377,   70,   53,  178,
        142, 1117,  897,  374,  666,  982,  834,   61,  386,  942,   19,
         59,    1,  157,  175,  194,  232,   32,   45,  113,  485,   72,
         37,   88,  197,  274,  472,  705,  808,  106,  384,  712,  260,
        498,   22,  167,  370,  172,  229,   69,  892,  215,  324,  697,
        268,  163,  231,  723,  600,   36,  176,  521,  287,  121,  180,
         49, 3775,  237,  281,  133,   76,  398,  207,  356,   15,  304,
        438,  419,   94, 1381,  112,  125,  678,  695,   26,  246,  937,
        200,  230,   75,  987,  544,  188,  990,  136,  192,  284, 1021,
        302,  254,  233,  186, 1578, 1129,   16,  463,  752,  283,  110,
         48,   91,  225,   20,  272,   83,  406,  221,   96, 1294, 1548,
       1086,  313,  159,   60,  349,  747,  129,  134,  861, 1207,  190,
        372,  156,  574,  339,  636, 1085,  323,  115,  303,  149,  659,
        247,    7,  417,  618,  392,  353,  424,  605,  154,  594,  102,
        371,  876,  396,  263,  924,  966,  222,   73,  948, 2282, 1124,
       1439,  479,  394,  298,  345,  708,  606,  357,  557,  342,  684,
         35, 1458,  278,  584,  973,  109,   92,  807,  503,  131, 3807,
        477,  648,   99,  228,   34, 1237,  481,  234,  843,  173,  249,
         62,   63,  728,  510,  326,  738,  691,  535,  305,  722,  255,
        363,  277,  633,  583, 1512,  786,  615, 2290,  508,  537,  265,
        505, 2271,  329, 2617,  623,  120,  780,  694,  140,  127,  866,
       1321,  266,  904,  251, 1096,  295,  483,  177,  143, 1564,   66,
        383, 1182,  849,  248,  169, 1360,  299,  252,  983,  321,  433,
        226,  718,  418,   50,  490,  312,  308, 2534,  432,  306,  117,
        139,  145,  533,  242,  358,  561,   68,  647, 3095,  895, 2306,
        158,  499,  426, 1657,  107,  152,  336, 4620,  536,  748, 1201,
       1100,  388,  686,  495,  469,  465, 1843, 3083,  294,  638,  409,
        603,   52,  334,  126,  854, 1398,  259,  496,   57,  297,  453,
        750,  105,  338,  923,  597,   38,  257, 2580,  482,  415,  410,
       2057,  155,  340,  837,  504, 1140,  434,  972,  397, 1330,  427,
         97,  101,  766,  541, 1454, 1113,  478,  425,  227,  293,  652,
        309, 1741,  320,  288,  199,  701,  777,  489,  325,  760,  459,
        576,  196,  448,  957,   18, 1089,  643,  331,  794,  649, 1277,
        195,  212, 1038,  318,  621,   41, 1215,   79,  480, 1216,   31,
         98,  462,  183,  619,   81,  522,  429,    5,  585,  275,  333,
        300,  279,  365, 1884, 1191,  518,  344, 1104,  891, 1156, 1605,
        710, 1088,  367,  817,   33,  213,  502,  558,  512, 1134,  943,
        337,  548,  454,  995,  360,  468,  630,  963,  640, 1331,   17,
        376,  509, 1732, 1722,  286,  461,  520,  671,  168, 1111,  492,
        361,  661, 1103,  389, 1762,  685, 1443,  840,  570,  390,  497,
        823,  588,  343,  838,  414,   93,  517, 2071, 1047,  464,  436,
        884,  700,  423,  335, 1242,  754, 3978, 1049,  347,   14, 1766,
       3113, 2204,  724,  391,  514,  713,  715, 2246, 2698, 1177,  674,
        579, 1541,  470, 2750, 3785,  381, 1018, 2987,  487,  416,  676,
        970,  732,  411,  359,  439, 1584,  348,  792, 1214,  886,  341,
        919,  663, 5448,  408,  476, 1679,  519,  582,  865,  366,  442,
        818, 1520, 1283,  445,  994,  566,  776,  656,  862,  328,  446,
       1055, 1922,  524,  385,  951,  628, 1097,  352,  620,  859,  422,
       1223,  894, 2676,  405,  965, 1274,    8,  466, 1037,  330,  997,
       1858,  918, 1197,  559,  757,  692, 1203,  420, 2126, 3444, 1063,
        741,  526,  289, 1333,  614,  531, 1599, 1094, 1342,  575,  616,
        721,  941, 4055,  714,  494, 1003, 1669,  387,  631,  382,  774,
        572, 1026,  812,  910, 1646,  816,  599,  952,  546, 1846,  431,
        625, 1537,  208,  764,  991,  421,  858,  500,  725,  447,  711,
        491,  826,  565,  296, 1530,  679,  608])

Adding an 'Vegan' and 'Vegetarian' columns, deriving from the words in 'Type'

In [76]:
def extract_vegan(typ):
  if str(typ).lower().find('vegan') == -1:
    return False
  return True

def extract_vegetarian(typ):
  if str(typ).lower().find('vegetarian') == -1:
    return False
  return True

df['Vegan'] = df['Type'].apply(extract_vegan)
df['Vegetarian'] = df['Type'].apply(extract_vegetarian)

Removing bogus values for 'Price_Range' column

In [77]:
df['Price_Range'].count()

2959

In [78]:
df = df[df.Price_Range.isin(['$', '$$ - $$$', '$$$$'])]
df.shape

(2953, 8)

In [79]:
df.Price_Range = df.Price_Range.replace(['$', '$$ - $$$', '$$$$'], ['Cheap', 'Medium', 'Pricey'])
df.Price_Range.unique()

array(['Medium', 'Pricey', 'Cheap'], dtype=object)

Remove duplicates

In [80]:
df = df.drop_duplicates()

One last look at the data before saving as our clean dataset

In [81]:
clean_df = df
print(clean_df.shape)
clean_df.isna().sum()

(2790, 8)

Name              0
Type             21
Reviews           0
No_of_Reviews     0
Menu              0
Price_Range       0
Vegan             0
Vegetarian        0
dtype: int64

In [82]:
clean_df.head()

,Name,Type,Reviews,No_of_Reviews,Menu,Price_Range,Vegan,Vegetarian
0,Betty Lou's Seafood and Grill,"Seafood, Vegetarian Friendly, Vegan Options",4.5,243,Check The Website for a Menu,Medium,True,True
1,Coach House Diner,"Diner, American, Vegetarian Friendly",4.0,84,Check The Website for a Menu,Medium,False,True
2,Table Talk Diner,"American, Diner, Vegetarian Friendly",4.0,256,http://tabletalkdiner.com/menu/breakfast/,Medium,False,True
3,Sixty Vines,"American, Wine Bar, Vegetarian Friendly",4.5,235,https://sixtyvines.com/menu/plano-tx/,Medium,False,True
4,The Clam Bar,"American, Bar, Seafood",4.0,285,Check The Website for a Menu,Medium,False,False

In [83]:
clean_df.describe()

           Reviews  No_of_Reviews
count  2790.000000    2790.000000
mean      4.325986     302.322581
std       0.271621     407.759069
min       3.500000       5.000000
25%       4.000000      90.000000
50%       4.500000     188.000000
75%       4.500000     342.000000
max       5.000000    5448.000000

In [84]:
clean_df.to_csv('clean_TripAdvisor.csv', index=False)